lis = ['作者',
 ':',
 '木心讲述',
 '/',
 '陈丹青笔录',
 '出版社:',
 '广西师范大学出版社',
 '出品方:',
 '理想国',
 '副标题:',
 '1989—1994',
 '出版年:',
 '2013-1-10',
 '页数:',
 '1102',
 '定价:',
 '98.00元',
 '装帧:',
 '精装',
 '丛书:',
 '理想国·木心作品',
 'ISBN:',
 '9787549530816']




li = ['\n        ',
                    '浑融一气的好小说，这不提了。\n'
                    '《边城》的情节与行文是浑融一体的，清澈的情节，清澈的字句。文情、文气与文笔相得益彰到这程度，极难得。\n'
                    '\n'
                    '比起其他故作清纯的小说，沈从文先生的清澈在于：\n'
                    '他的小说并不回避悲剧，并不回避死亡（天保和爷爷的死去），也不回避妓女们的存在。他的清澈，是另创了一个质朴地接受一切、如实道来的语境。\n'
                    '所以《边城》里的妓女和粗野水手，都比当下许多闺阁小说里满口伪文言的大小姐们干净得多。',
                    '\n'
                    '\n'
                    '而且，这小说使的虽是现代汉语，但气质上，很古中国。\n'
                    '\n'
                    '比如说，苏童先生的句子，比如“父王驾崩的那天早晨，霜露浓重，太阳犹如破碎的蛋黄悬浮于铜尺山的峰峦后面”，要让余光中先生来评价，必然会觉得略带翻译腔。\n'
                    '比如说，余华先生的句子，比如“屋檐滴水所显示的，是寂静的存在，我的逐渐入睡，是对雨中水滴的逐渐遗忘”，亦然。\n'
                    '并不是这些不好。当代中国小说的语调，是西方文学和中国文学混合而来。莫言先生小说中的拉美腔、残雪先生小说中的卡夫卡味道，诸如此类，不是坏事。\n'
                    '\n'
                    '但趋势和倾向是比出来的。有些小说家，是受过西方影响，但语句中间，亦然带纯粹中国语言味道的，比如张爱玲，比如老舍先生。\n'
                    '以及沈从文先生。\n'
                    '\n'
                    '老舍先生的文字是北京口语的，而沈从文先生，带有一种，怎么说呢？中国古散文的字句质感。\n'
                    '\n'
                    '“为了住处两山多篁竹，翠色逼人而来……翠翠在风日里长养着，把皮肤变得黑黑的，触目为青山绿水，一对眸子清明如水晶。”\n'
                    '\n'
                    '这句里，有种细腻的微妙语感。最好的两个字，一是逼，“翠色逼人而来”，一是“长养着”，非常质朴。\n'
                    '这两句，带着中国传统诗歌炼字的味道了。\n'
                    '\n'
                    '“爷爷到溪中央便很快乐的唱起来，哑哑的声音同竹管声振荡在寂静空气里，溪中仿佛也热闹了一些。实则歌声的来复，反而使一切更寂静一些了。”\n'
                    '\n'
                    '这末一句，他人写不出，真是很古朴的玄灵清透之感了。',
                    ' 最妙处，还是纯真背后的气性。',
                    '《边城》的善良纯真，好在不脱',
                    '野气',
                    '。性格纯真的人，往往带点鲁莽与执拗。《边城》里的人就是善良纯真到耿直骄傲的地步——于是情节全出来了。',
                    '《边城》里发生的一切冲突，并不是有哪个角色是坏人。恰好因为所有角色都善良纯真，才出了矛盾。',
                    '翠翠是纯真善良的，但也有点野。初次见二老时，以为二老要调戏她，就骂他“你个悖时砍脑壳的”。',
                    '爷爷是纯真善良的，但也有点野。他一辈子都在想为翠翠谋幸福，有点狡猾，有点妩媚，且一旦觉得被人看不起了，就会沟通有问题。',
                    '大老是纯真善良的，但性子有些执拗。觉得自己输给二老了，就赌气离开了。',
                    '二老是纯真善良的，甚至肯替大哥唱歌求爱，以得个光明磊落；但他一旦觉得是自己害死了大哥，就走了，不肯回来了。',
                    '二位青年的父亲顺顺是纯真善良的，但性格也有些拗。因为儿子死了，难免口气重了，才让爷爷觉得郁闷。',
                    '支撑《边城》里所有人性格的，是一口纯真之下的骄傲，一点气性。',
                    '这点气性，让两个男生要用唱歌（实际上就二老一个人在唱）的方式追女孩子。',
                    '这点气性，让大老死了，让二老离开了。',
                    '这点气性，让爷爷觉得难过，终于病死了。',
                    '没有人是坏人。只是一口气罢了。',
                    '这才是生活的真实。',
                    '沈从文先生的确把《边城》写成了世外桃源，但没写成谦恭礼让的君子国。',
                    '淳朴的渔夫也会念叨并炫耀交好的妓女。淳朴的爷爷也会贪一口烧酒。淳朴的翠翠也会骂人。大家都多少有那么一口气，那么一点儿，人味。',
                    '这种劲头和气性，才是小说的根本。',
                    '这也是结局真正巧妙的地方。到结尾，顺顺已经接受了翠翠这个准媳妇，翠翠也已经明白了一切。只等二老回来。',
                    '阻碍二老回来的，是一口气。',
                    '一旦哪天，二老对翠翠的爱，终于胜过了对哥哥的歉疚，他就回来了。',
                    '所以他不回来的结局很忧伤，但他依然是耿直的好青年；回来了，就是个团圆结尾。',
                    '是这种气性让爱情发生的，是这种气性让爱情造出悲剧的，是这种气性让结尾悬空等候的。',
                    '现在再品品这句：',
                    '“那个人也许永远不回来了，也许明天回来”。',
                    '是不是，滋味稍微不同些？',
                    '\n      ']
import re
print('\n'.join([val for val in list(map(lambda x:re.sub('[\n\s]', '', x), li)) if val!='']))




# 默认解析start_urls的第一个链接!!!
# 可以思考一个问题，start_urls为什么要设计成一个列表？而不是一个普通字符串
# 估计是考虑到爬取深度翻页时，会遇到多个跳板url，一般来说，跳板url的数据需要调用
# parse_start_url方法来得到，但是如果有多个跳板，那么将无从下手
# 所以我估计，可以使用response.url来判断，当前是位于哪个跳板url，从而做相应的处理
# def parse_start_url(self, response):
#     print(response.url)
#     url_list = response.xpath('//div[@class="pic"]/a[@class="nbg"]/@href').getall()
#     print(url_list)
#     for url in url_list:
#         yield  scrapy.Request(url=url, callback=self.parse_book_detail, dont_filter=True)







# 有一个小问题，最大书本数量为1000，对应页面是第50页
# 如何加个终止链接提取的操作
# 解决办法：process_links对提取到的链接过滤







# Rule对象详解
# 默认会从a标签下提取链接
# 包含小说的页面
# 用process_book_links拼凑request_url，得到首页数据
# 可以省去用parse_start_url解析首页数据的步骤!!!
# referer参数表示当前请求的来源url
# 如果是Crawled当前页面url的话，那么referer就表示上一页的url
# 如果是Crawled当前页面下的书本url，则referer就表示当前页面url
# 层层递进的关系，取决于你的rule怎么定义

'''
# 小说书评链接页[此外还包括短评、读书笔记等分类]
# https://book.douban.com/subject/2567698/reviews
# <-------------------------跳板二---------------------->
Rule(LinkExtractor(allow=r'/subject/\d+/reviews/$'), process_links='process_commit_links', follow=True),
# https://book.douban.com/subject/2567698/reviews?start=20
# 调用process_book_links拼凑request_url得到跳板首页数据
# <-------------------------跳板二---------------------->
# 小说书评翻页
Rule(LinkExtractor(allow=r'/subject/\d+/reviews\?start=\d+/$', unique=True), process_links='process_commit_links',
     follow=True),
# 小说书评详情页
Rule(LinkExtractor(restrict_xpaths='//div[@class="main review-item"]//div[@class="main-hd"]/h2', unique=True),
     callback='parse_commit_detail'),
'''